<a href="https://colab.research.google.com/github/UnplugCharger/Week-6-IP/blob/master/Week6_Ip_FINAL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#IMPORTING LIBRARIES

In [2]:
import pandas as pd
import numpy as np

#INITIAL LOOK INTO OUR DATA

**Importing or datasets**

In [4]:
results=pd.read_csv('/content/drive/My Drive/Core Datasets/results.csv')
fifa=pd.read_csv('/content/drive/My Drive/Core Datasets/fifa_ranking.csv')

In [5]:
def sniff(df):
    with pd.option_context("display.max_colwidth", 20):
        info = pd.DataFrame()
        info['sample'] = df.iloc[0]
        info['data type'] = df.dtypes
        info['percent duplicated'] = df.duplicated().sum()*100/len(df)
        info['percent missing'] = df.isnull().sum()*100/len(df)
        return info.sort_values('data type')

In [6]:
sniff(results)

                sample data type  percent duplicated  percent missing
neutral          False      bool                 0.0              0.0
home_score           0     int64                 0.0              0.0
away_score           0     int64                 0.0              0.0
date        1872-11-30    object                 0.0              0.0
home_team     Scotland    object                 0.0              0.0
away_team      England    object                 0.0              0.0
tournament    Friendly    object                 0.0              0.0
city           Glasgow    object                 0.0              0.0
country       Scotland    object                 0.0              0.0

In [7]:
sniff(fifa)

                             sample  ... percent missing
rank                              1  ...             0.0
previous_points                  57  ...             0.0
rank_change                       0  ...             0.0
total_points                      0  ...             0.0
cur_year_avg                      0  ...             0.0
cur_year_avg_weighted             0  ...             0.0
last_year_avg                     0  ...             0.0
last_year_avg_weighted            0  ...             0.0
two_year_ago_avg                  0  ...             0.0
two_year_ago_weighted             0  ...             0.0
three_year_ago_avg                0  ...             0.0
three_year_ago_weighted           0  ...             0.0
country_full                Germany  ...             0.0
country_abrv                    GER  ...             0.0
confederation                  UEFA  ...             0.0
rank_date                1993-08-08  ...             0.0

[16 rows x 4 columns]

From the above ... we have no duplicates and null values in the Results dataset . 
We have  no null values on the fifa dataset  but we have  0.06402 % duplicated values

We are goin to drop these values in our next step

#DATA CLEANING

In [8]:
results.describe()

         home_score    away_score
count  40839.000000  40839.000000
mean       1.745709      1.188105
std        1.749145      1.405120
min        0.000000      0.000000
25%        1.000000      0.000000
50%        1.000000      1.000000
75%        2.000000      2.000000
max       31.000000     21.000000

In [9]:
fifa.describe()

               rank  total_points  ...  three_year_ago_avg  three_year_ago_weighted
count  57793.000000  57793.000000  ...        57793.000000             57793.000000
mean     101.628086    122.068637  ...           59.173916                11.834811
std       58.618424    260.426863  ...          135.533343                27.106675
min        1.000000      0.000000  ...            0.000000                 0.000000
25%       51.000000      0.000000  ...            0.000000                 0.000000
50%      101.000000      0.000000  ...            0.000000                 0.000000
75%      152.000000     92.790000  ...           21.250000                 4.250000
max      209.000000   1775.030000  ...         1200.770000               240.150000

[8 rows x 12 columns]

From the above we can see some values like the maximum home team goal of 31. That is very posible in football but rarely occurs  in football and we are going to drop them 

we also see that the away score has a maximum of 21 ... this can happen in football but we are going to drop them as it rarely occurs

In [10]:
fifa.drop_duplicates(inplace=True)

In [11]:
sniff(fifa)

                             sample  ... percent missing
rank                              1  ...             0.0
previous_points                  57  ...             0.0
rank_change                       0  ...             0.0
total_points                      0  ...             0.0
cur_year_avg                      0  ...             0.0
cur_year_avg_weighted             0  ...             0.0
last_year_avg                     0  ...             0.0
last_year_avg_weighted            0  ...             0.0
two_year_ago_avg                  0  ...             0.0
two_year_ago_weighted             0  ...             0.0
three_year_ago_avg                0  ...             0.0
three_year_ago_weighted           0  ...             0.0
country_full                Germany  ...             0.0
country_abrv                    GER  ...             0.0
confederation                  UEFA  ...             0.0
rank_date                1993-08-08  ...             0.0

[16 rows x 4 columns]

In [12]:
fifa.shape

(57756, 16)

Even after dropping the duplicates we still have a good amount of data which is **fabulous**

In [18]:
results[results.home_score<15]

             date         home_team  ...   country  neutral
0      1872-11-30          Scotland  ...  Scotland    False
1      1873-03-08           England  ...   England    False
2      1874-03-07          Scotland  ...  Scotland    False
3      1875-03-06           England  ...   England    False
4      1876-03-04          Scotland  ...  Scotland    False
...           ...               ...  ...       ...      ...
40834  2019-07-18    American Samoa  ...     Samoa     True
40835  2019-07-18              Fiji  ...     Samoa     True
40836  2019-07-19           Senegal  ...     Egypt     True
40837  2019-07-19        Tajikistan  ...     India     True
40838  2019-07-20  Papua New Guinea  ...     Samoa     True

[40813 rows x 9 columns]

In [19]:
results[results.away_score<15]

             date         home_team  ...   country  neutral
0      1872-11-30          Scotland  ...  Scotland    False
1      1873-03-08           England  ...   England    False
2      1874-03-07          Scotland  ...  Scotland    False
3      1875-03-06           England  ...   England    False
4      1876-03-04          Scotland  ...  Scotland    False
...           ...               ...  ...       ...      ...
40834  2019-07-18    American Samoa  ...     Samoa     True
40835  2019-07-18              Fiji  ...     Samoa     True
40836  2019-07-19           Senegal  ...     Egypt     True
40837  2019-07-19        Tajikistan  ...     India     True
40838  2019-07-20  Papua New Guinea  ...     Samoa     True

[40816 rows x 9 columns]